SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_agc.h
/* Bit fields for AGC IF */
#define _AGC_IF_RESETVALUE                             0x00000000UL                              /**< Default value for AGC_IF                    */
#define _AGC_IF_MASK                                   0x0003FF7DUL                              /**< Mask for AGC_IF                             */
#define AGC_IF_RSSIVALID                               (0x1UL << 0)                              /**< RSSI Value is Valid                         */
#define _AGC_IF_RSSIVALID_SHIFT                        0                                         /**< Shift value for AGC_RSSIVALID               */
#define _AGC_IF_RSSIVALID_MASK                         0x1UL                                     /**< Bit mask for AGC_RSSIVALID                  */
#define _AGC_IF_RSSIVALID_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_RSSIVALID_DEFAULT                       (_AGC_IF_RSSIVALID_DEFAULT << 0)          /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_CCA                                     (0x1UL << 2)                              /**< Clear Channel Assessment                    */
#define _AGC_IF_CCA_SHIFT                              2                                         /**< Shift value for AGC_CCA                     */
#define _AGC_IF_CCA_MASK                               0x4UL                                     /**< Bit mask for AGC_CCA                        */
#define _AGC_IF_CCA_DEFAULT                            0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_CCA_DEFAULT                             (_AGC_IF_CCA_DEFAULT << 2)                /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_RSSIPOSSTEP                             (0x1UL << 3)                              /**< Positive RSSI Step Detected                 */
#define _AGC_IF_RSSIPOSSTEP_SHIFT                      3                                         /**< Shift value for AGC_RSSIPOSSTEP             */
#define _AGC_IF_RSSIPOSSTEP_MASK                       0x8UL                                     /**< Bit mask for AGC_RSSIPOSSTEP                */
#define _AGC_IF_RSSIPOSSTEP_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_RSSIPOSSTEP_DEFAULT                     (_AGC_IF_RSSIPOSSTEP_DEFAULT << 3)        /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_RSSINEGSTEP                             (0x1UL << 4)                              /**< Negative RSSI Step Detected                 */
#define _AGC_IF_RSSINEGSTEP_SHIFT                      4                                         /**< Shift value for AGC_RSSINEGSTEP             */
#define _AGC_IF_RSSINEGSTEP_MASK                       0x10UL                                    /**< Bit mask for AGC_RSSINEGSTEP                */
#define _AGC_IF_RSSINEGSTEP_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_RSSINEGSTEP_DEFAULT                     (_AGC_IF_RSSINEGSTEP_DEFAULT << 4)        /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_SHORTRSSIPOSSTEP                        (0x1UL << 6)                              /**< Short-term Positive RSSI Step Detected      */
#define _AGC_IF_SHORTRSSIPOSSTEP_SHIFT                 6                                         /**< Shift value for AGC_SHORTRSSIPOSSTEP        */
#define _AGC_IF_SHORTRSSIPOSSTEP_MASK                  0x40UL                                    /**< Bit mask for AGC_SHORTRSSIPOSSTEP           */
#define _AGC_IF_SHORTRSSIPOSSTEP_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_SHORTRSSIPOSSTEP_DEFAULT                (_AGC_IF_SHORTRSSIPOSSTEP_DEFAULT << 6)   /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_RFPKDPRDDONE                            (0x1UL << 8)                              /**< RF PKD PERIOD CNT TOMEOUT                   */
#define _AGC_IF_RFPKDPRDDONE_SHIFT                     8                                         /**< Shift value for AGC_RFPKDPRDDONE            */
#define _AGC_IF_RFPKDPRDDONE_MASK                      0x100UL                                   /**< Bit mask for AGC_RFPKDPRDDONE               */
#define _AGC_IF_RFPKDPRDDONE_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_RFPKDPRDDONE_DEFAULT                    (_AGC_IF_RFPKDPRDDONE_DEFAULT << 8)       /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_RFPKDCNTDONE                            (0x1UL << 9)                              /**< RF PKD pulse CNT TOMEOUT                    */
#define _AGC_IF_RFPKDCNTDONE_SHIFT                     9                                         /**< Shift value for AGC_RFPKDCNTDONE            */
#define _AGC_IF_RFPKDCNTDONE_MASK                      0x200UL                                   /**< Bit mask for AGC_RFPKDCNTDONE               */
#define _AGC_IF_RFPKDCNTDONE_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_RFPKDCNTDONE_DEFAULT                    (_AGC_IF_RFPKDCNTDONE_DEFAULT << 9)       /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_RSSIHIGH                                (0x1UL << 10)                             /**< RSSI high detected                          */
#define _AGC_IF_RSSIHIGH_SHIFT                         10                                        /**< Shift value for AGC_RSSIHIGH                */
#define _AGC_IF_RSSIHIGH_MASK                          0x400UL                                   /**< Bit mask for AGC_RSSIHIGH                   */
#define _AGC_IF_RSSIHIGH_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_RSSIHIGH_DEFAULT                        (_AGC_IF_RSSIHIGH_DEFAULT << 10)          /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_RSSILOW                                 (0x1UL << 11)                             /**< RSSI low detected                           */
#define _AGC_IF_RSSILOW_SHIFT                          11                                        /**< Shift value for AGC_RSSILOW                 */
#define _AGC_IF_RSSILOW_MASK                           0x800UL                                   /**< Bit mask for AGC_RSSILOW                    */
#define _AGC_IF_RSSILOW_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_RSSILOW_DEFAULT                         (_AGC_IF_RSSILOW_DEFAULT << 11)           /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_CCANODET                                (0x1UL << 12)                             /**< CCA Not Detected                            */
#define _AGC_IF_CCANODET_SHIFT                         12                                        /**< Shift value for AGC_CCANODET                */
#define _AGC_IF_CCANODET_MASK                          0x1000UL                                  /**< Bit mask for AGC_CCANODET                   */
#define _AGC_IF_CCANODET_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_CCANODET_DEFAULT                        (_AGC_IF_CCANODET_DEFAULT << 12)          /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_GAINBELOWGAINTHD                        (0x1UL << 13)                             /**< agc gain above threshold int                */
#define _AGC_IF_GAINBELOWGAINTHD_SHIFT                 13                                        /**< Shift value for AGC_GAINBELOWGAINTHD        */
#define _AGC_IF_GAINBELOWGAINTHD_MASK                  0x2000UL                                  /**< Bit mask for AGC_GAINBELOWGAINTHD           */
#define _AGC_IF_GAINBELOWGAINTHD_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_GAINBELOWGAINTHD_DEFAULT                (_AGC_IF_GAINBELOWGAINTHD_DEFAULT << 13)  /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_GAINUPDATEFRZ                           (0x1UL << 14)                             /**< AGC gain update frozen int                  */
#define _AGC_IF_GAINUPDATEFRZ_SHIFT                    14                                        /**< Shift value for AGC_GAINUPDATEFRZ           */
#define _AGC_IF_GAINUPDATEFRZ_MASK                     0x4000UL                                  /**< Bit mask for AGC_GAINUPDATEFRZ              */
#define _AGC_IF_GAINUPDATEFRZ_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_GAINUPDATEFRZ_DEFAULT                   (_AGC_IF_GAINUPDATEFRZ_DEFAULT << 14)     /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_PNATTEN                                 (0x1UL << 15)                             /**< PN attenuation is exceeding threshold       */
#define _AGC_IF_PNATTEN_SHIFT                          15                                        /**< Shift value for AGC_PNATTEN                 */
#define _AGC_IF_PNATTEN_MASK                           0x8000UL                                  /**< Bit mask for AGC_PNATTEN                    */
#define _AGC_IF_PNATTEN_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_PNATTEN_DEFAULT                         (_AGC_IF_PNATTEN_DEFAULT << 15)           /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_COLLDETRSSIMAPRE                        (0x1UL << 16)                             /**< Collision Detection outside of frame        */
#define _AGC_IF_COLLDETRSSIMAPRE_SHIFT                 16                                        /**< Shift value for AGC_COLLDETRSSIMAPRE        */
#define _AGC_IF_COLLDETRSSIMAPRE_MASK                  0x10000UL                                 /**< Bit mask for AGC_COLLDETRSSIMAPRE           */
#define _AGC_IF_COLLDETRSSIMAPRE_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_COLLDETRSSIMAPRE_DEFAULT                (_AGC_IF_COLLDETRSSIMAPRE_DEFAULT << 16)  /**< Shifted mode DEFAULT for AGC_IF             */
#define AGC_IF_COLLDETRSSIMASYNC                       (0x1UL << 17)                             /**< Collsion detection during frame             */
#define _AGC_IF_COLLDETRSSIMASYNC_SHIFT                17                                        /**< Shift value for AGC_COLLDETRSSIMASYNC       */
#define _AGC_IF_COLLDETRSSIMASYNC_MASK                 0x20000UL                                 /**< Bit mask for AGC_COLLDETRSSIMASYNC          */
#define _AGC_IF_COLLDETRSSIMASYNC_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for AGC_IF                     */
#define AGC_IF_COLLDETRSSIMASYNC_DEFAULT               (_AGC_IF_COLLDETRSSIMASYNC_DEFAULT << 17) /**< Shifted mode DEFAULT for AGC_IF             */

/* Bit fields for AGC IEN */
#define _AGC_IEN_RESETVALUE                            0x00000000UL                               /**< Default value for AGC_IEN                   */
#define _AGC_IEN_MASK                                  0x0003FF7DUL                               /**< Mask for AGC_IEN                            */
#define AGC_IEN_RSSIVALID                              (0x1UL << 0)                               /**< RSSIVALID Interrupt Enable                  */
#define _AGC_IEN_RSSIVALID_SHIFT                       0                                          /**< Shift value for AGC_RSSIVALID               */
#define _AGC_IEN_RSSIVALID_MASK                        0x1UL                                      /**< Bit mask for AGC_RSSIVALID                  */
#define _AGC_IEN_RSSIVALID_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_RSSIVALID_DEFAULT                      (_AGC_IEN_RSSIVALID_DEFAULT << 0)          /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_CCA                                    (0x1UL << 2)                               /**< CCA Interrupt Enable                        */
#define _AGC_IEN_CCA_SHIFT                             2                                          /**< Shift value for AGC_CCA                     */
#define _AGC_IEN_CCA_MASK                              0x4UL                                      /**< Bit mask for AGC_CCA                        */
#define _AGC_IEN_CCA_DEFAULT                           0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_CCA_DEFAULT                            (_AGC_IEN_CCA_DEFAULT << 2)                /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_RSSIPOSSTEP                            (0x1UL << 3)                               /**< RSSIPOSSTEP Interrupt Enable                */
#define _AGC_IEN_RSSIPOSSTEP_SHIFT                     3                                          /**< Shift value for AGC_RSSIPOSSTEP             */
#define _AGC_IEN_RSSIPOSSTEP_MASK                      0x8UL                                      /**< Bit mask for AGC_RSSIPOSSTEP                */
#define _AGC_IEN_RSSIPOSSTEP_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_RSSIPOSSTEP_DEFAULT                    (_AGC_IEN_RSSIPOSSTEP_DEFAULT << 3)        /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_RSSINEGSTEP                            (0x1UL << 4)                               /**< RSSINEGSTEP Interrupt Enable                */
#define _AGC_IEN_RSSINEGSTEP_SHIFT                     4                                          /**< Shift value for AGC_RSSINEGSTEP             */
#define _AGC_IEN_RSSINEGSTEP_MASK                      0x10UL                                     /**< Bit mask for AGC_RSSINEGSTEP                */
#define _AGC_IEN_RSSINEGSTEP_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_RSSINEGSTEP_DEFAULT                    (_AGC_IEN_RSSINEGSTEP_DEFAULT << 4)        /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_SHORTRSSIPOSSTEP                       (0x1UL << 6)                               /**< SHORTRSSIPOSSTEP Interrupt Enable           */
#define _AGC_IEN_SHORTRSSIPOSSTEP_SHIFT                6                                          /**< Shift value for AGC_SHORTRSSIPOSSTEP        */
#define _AGC_IEN_SHORTRSSIPOSSTEP_MASK                 0x40UL                                     /**< Bit mask for AGC_SHORTRSSIPOSSTEP           */
#define _AGC_IEN_SHORTRSSIPOSSTEP_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_SHORTRSSIPOSSTEP_DEFAULT               (_AGC_IEN_SHORTRSSIPOSSTEP_DEFAULT << 6)   /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_RFPKDPRDDONE                           (0x1UL << 8)                               /**< RF PKD PERIOD CNT Interrupt Enable          */
#define _AGC_IEN_RFPKDPRDDONE_SHIFT                    8                                          /**< Shift value for AGC_RFPKDPRDDONE            */
#define _AGC_IEN_RFPKDPRDDONE_MASK                     0x100UL                                    /**< Bit mask for AGC_RFPKDPRDDONE               */
#define _AGC_IEN_RFPKDPRDDONE_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_RFPKDPRDDONE_DEFAULT                   (_AGC_IEN_RFPKDPRDDONE_DEFAULT << 8)       /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_RFPKDCNTDONE                           (0x1UL << 9)                               /**< RF PKD pulse CNT Interrupt Enable           */
#define _AGC_IEN_RFPKDCNTDONE_SHIFT                    9                                          /**< Shift value for AGC_RFPKDCNTDONE            */
#define _AGC_IEN_RFPKDCNTDONE_MASK                     0x200UL                                    /**< Bit mask for AGC_RFPKDCNTDONE               */
#define _AGC_IEN_RFPKDCNTDONE_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_RFPKDCNTDONE_DEFAULT                   (_AGC_IEN_RFPKDCNTDONE_DEFAULT << 9)       /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_RSSIHIGH                               (0x1UL << 10)                              /**< RSSIHIGH Interrupt Enable                   */
#define _AGC_IEN_RSSIHIGH_SHIFT                        10                                         /**< Shift value for AGC_RSSIHIGH                */
#define _AGC_IEN_RSSIHIGH_MASK                         0x400UL                                    /**< Bit mask for AGC_RSSIHIGH                   */
#define _AGC_IEN_RSSIHIGH_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_RSSIHIGH_DEFAULT                       (_AGC_IEN_RSSIHIGH_DEFAULT << 10)          /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_RSSILOW                                (0x1UL << 11)                              /**< RSSILOW Interrupt Enable                    */
#define _AGC_IEN_RSSILOW_SHIFT                         11                                         /**< Shift value for AGC_RSSILOW                 */
#define _AGC_IEN_RSSILOW_MASK                          0x800UL                                    /**< Bit mask for AGC_RSSILOW                    */
#define _AGC_IEN_RSSILOW_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_RSSILOW_DEFAULT                        (_AGC_IEN_RSSILOW_DEFAULT << 11)           /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_CCANODET                               (0x1UL << 12)                              /**< CCANODET Interrupt Enable                   */
#define _AGC_IEN_CCANODET_SHIFT                        12                                         /**< Shift value for AGC_CCANODET                */
#define _AGC_IEN_CCANODET_MASK                         0x1000UL                                   /**< Bit mask for AGC_CCANODET                   */
#define _AGC_IEN_CCANODET_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_CCANODET_DEFAULT                       (_AGC_IEN_CCANODET_DEFAULT << 12)          /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_GAINBELOWGAINTHD                       (0x1UL << 13)                              /**< GAINBELOWGAINTHD Interrupt Enable           */
#define _AGC_IEN_GAINBELOWGAINTHD_SHIFT                13                                         /**< Shift value for AGC_GAINBELOWGAINTHD        */
#define _AGC_IEN_GAINBELOWGAINTHD_MASK                 0x2000UL                                   /**< Bit mask for AGC_GAINBELOWGAINTHD           */
#define _AGC_IEN_GAINBELOWGAINTHD_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_GAINBELOWGAINTHD_DEFAULT               (_AGC_IEN_GAINBELOWGAINTHD_DEFAULT << 13)  /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_GAINUPDATEFRZ                          (0x1UL << 14)                              /**< AGC gain update frozen int Enable           */
#define _AGC_IEN_GAINUPDATEFRZ_SHIFT                   14                                         /**< Shift value for AGC_GAINUPDATEFRZ           */
#define _AGC_IEN_GAINUPDATEFRZ_MASK                    0x4000UL                                   /**< Bit mask for AGC_GAINUPDATEFRZ              */
#define _AGC_IEN_GAINUPDATEFRZ_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_GAINUPDATEFRZ_DEFAULT                  (_AGC_IEN_GAINUPDATEFRZ_DEFAULT << 14)     /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_PNATTEN                                (0x1UL << 15)                              /**< PN attenuation is exceeding threshold       */
#define _AGC_IEN_PNATTEN_SHIFT                         15                                         /**< Shift value for AGC_PNATTEN                 */
#define _AGC_IEN_PNATTEN_MASK                          0x8000UL                                   /**< Bit mask for AGC_PNATTEN                    */
#define _AGC_IEN_PNATTEN_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_PNATTEN_DEFAULT                        (_AGC_IEN_PNATTEN_DEFAULT << 15)           /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_COLLDETRSSIMAPRE                       (0x1UL << 16)                              /**< Collision Detection outside of frame        */
#define _AGC_IEN_COLLDETRSSIMAPRE_SHIFT                16                                         /**< Shift value for AGC_COLLDETRSSIMAPRE        */
#define _AGC_IEN_COLLDETRSSIMAPRE_MASK                 0x10000UL                                  /**< Bit mask for AGC_COLLDETRSSIMAPRE           */
#define _AGC_IEN_COLLDETRSSIMAPRE_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_COLLDETRSSIMAPRE_DEFAULT               (_AGC_IEN_COLLDETRSSIMAPRE_DEFAULT << 16)  /**< Shifted mode DEFAULT for AGC_IEN            */
#define AGC_IEN_COLLDETRSSIMASYNC                      (0x1UL << 17)                              /**< Collsion detection during frame             */
#define _AGC_IEN_COLLDETRSSIMASYNC_SHIFT               17                                         /**< Shift value for AGC_COLLDETRSSIMASYNC       */
#define _AGC_IEN_COLLDETRSSIMASYNC_MASK                0x20000UL                                  /**< Bit mask for AGC_COLLDETRSSIMASYNC          */
#define _AGC_IEN_COLLDETRSSIMASYNC_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for AGC_IEN                    */
#define AGC_IEN_COLLDETRSSIMASYNC_DEFAULT              (_AGC_IEN_COLLDETRSSIMASYNC_DEFAULT << 17) /**< Shifted mode DEFAULT for AGC_IEN            */

