SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_agc.h
/* Bit fields for AGC PNRFATT3 */
#define _AGC_PNRFATT3_RESETVALUE                       0x01B400E4UL                               /**< Default value for AGC_PNRFATT3              */
#define _AGC_PNRFATT3_MASK                             0x3FFF3FFFUL                               /**< Mask for AGC_PNRFATT3                       */
#define _AGC_PNRFATT3_LNAMIXRFATT7_SHIFT               0                                          /**< Shift value for AGC_LNAMIXRFATT7            */
#define _AGC_PNRFATT3_LNAMIXRFATT7_MASK                0x3FFFUL                                   /**< Bit mask for AGC_LNAMIXRFATT7               */
#define _AGC_PNRFATT3_LNAMIXRFATT7_DEFAULT             0x000000E4UL                               /**< Mode DEFAULT for AGC_PNRFATT3               */
#define AGC_PNRFATT3_LNAMIXRFATT7_DEFAULT              (_AGC_PNRFATT3_LNAMIXRFATT7_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT3       */
#define _AGC_PNRFATT3_LNAMIXRFATT8_SHIFT               16                                         /**< Shift value for AGC_LNAMIXRFATT8            */
#define _AGC_PNRFATT3_LNAMIXRFATT8_MASK                0x3FFF0000UL                               /**< Bit mask for AGC_LNAMIXRFATT8               */
#define _AGC_PNRFATT3_LNAMIXRFATT8_DEFAULT             0x000001B4UL                               /**< Mode DEFAULT for AGC_PNRFATT3               */
#define AGC_PNRFATT3_LNAMIXRFATT8_DEFAULT              (_AGC_PNRFATT3_LNAMIXRFATT8_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_PNRFATT3       */

/* Bit fields for AGC PNRFATT4 */
#define _AGC_PNRFATT4_RESETVALUE                       0x039C029CUL                                /**< Default value for AGC_PNRFATT4              */
#define _AGC_PNRFATT4_MASK                             0x3FFF3FFFUL                                /**< Mask for AGC_PNRFATT4                       */
#define _AGC_PNRFATT4_LNAMIXRFATT9_SHIFT               0                                           /**< Shift value for AGC_LNAMIXRFATT9            */
#define _AGC_PNRFATT4_LNAMIXRFATT9_MASK                0x3FFFUL                                    /**< Bit mask for AGC_LNAMIXRFATT9               */
#define _AGC_PNRFATT4_LNAMIXRFATT9_DEFAULT             0x0000029CUL                                /**< Mode DEFAULT for AGC_PNRFATT4               */
#define AGC_PNRFATT4_LNAMIXRFATT9_DEFAULT              (_AGC_PNRFATT4_LNAMIXRFATT9_DEFAULT << 0)   /**< Shifted mode DEFAULT for AGC_PNRFATT4       */
#define _AGC_PNRFATT4_LNAMIXRFATT10_SHIFT              16                                          /**< Shift value for AGC_LNAMIXRFATT10           */
#define _AGC_PNRFATT4_LNAMIXRFATT10_MASK               0x3FFF0000UL                                /**< Bit mask for AGC_LNAMIXRFATT10              */
#define _AGC_PNRFATT4_LNAMIXRFATT10_DEFAULT            0x0000039CUL                                /**< Mode DEFAULT for AGC_PNRFATT4               */
#define AGC_PNRFATT4_LNAMIXRFATT10_DEFAULT             (_AGC_PNRFATT4_LNAMIXRFATT10_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_PNRFATT4       */

/* Bit fields for AGC PNRFATT5 */
#define _AGC_PNRFATT5_RESETVALUE                       0x05FA04BAUL                                /**< Default value for AGC_PNRFATT5              */
#define _AGC_PNRFATT5_MASK                             0x3FFF3FFFUL                                /**< Mask for AGC_PNRFATT5                       */
#define _AGC_PNRFATT5_LNAMIXRFATT11_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT11           */
#define _AGC_PNRFATT5_LNAMIXRFATT11_MASK               0x3FFFUL                                    /**< Bit mask for AGC_LNAMIXRFATT11              */
#define _AGC_PNRFATT5_LNAMIXRFATT11_DEFAULT            0x000004BAUL                                /**< Mode DEFAULT for AGC_PNRFATT5               */
#define AGC_PNRFATT5_LNAMIXRFATT11_DEFAULT             (_AGC_PNRFATT5_LNAMIXRFATT11_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT5       */
#define _AGC_PNRFATT5_LNAMIXRFATT12_SHIFT              16                                          /**< Shift value for AGC_LNAMIXRFATT12           */
#define _AGC_PNRFATT5_LNAMIXRFATT12_MASK               0x3FFF0000UL                                /**< Bit mask for AGC_LNAMIXRFATT12              */
#define _AGC_PNRFATT5_LNAMIXRFATT12_DEFAULT            0x000005FAUL                                /**< Mode DEFAULT for AGC_PNRFATT5               */
#define AGC_PNRFATT5_LNAMIXRFATT12_DEFAULT             (_AGC_PNRFATT5_LNAMIXRFATT12_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_PNRFATT5       */

/* Bit fields for AGC PNRFATT6 */
#define _AGC_PNRFATT6_RESETVALUE                       0x0AA007EEUL                                /**< Default value for AGC_PNRFATT6              */
#define _AGC_PNRFATT6_MASK                             0x3FFF3FFFUL                                /**< Mask for AGC_PNRFATT6                       */
#define _AGC_PNRFATT6_LNAMIXRFATT13_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT13           */
#define _AGC_PNRFATT6_LNAMIXRFATT13_MASK               0x3FFFUL                                    /**< Bit mask for AGC_LNAMIXRFATT13              */
#define _AGC_PNRFATT6_LNAMIXRFATT13_DEFAULT            0x000007EEUL                                /**< Mode DEFAULT for AGC_PNRFATT6               */
#define AGC_PNRFATT6_LNAMIXRFATT13_DEFAULT             (_AGC_PNRFATT6_LNAMIXRFATT13_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT6       */
#define _AGC_PNRFATT6_LNAMIXRFATT14_SHIFT              16                                          /**< Shift value for AGC_LNAMIXRFATT14           */
#define _AGC_PNRFATT6_LNAMIXRFATT14_MASK               0x3FFF0000UL                                /**< Bit mask for AGC_LNAMIXRFATT14              */
#define _AGC_PNRFATT6_LNAMIXRFATT14_DEFAULT            0x00000AA0UL                                /**< Mode DEFAULT for AGC_PNRFATT6               */
#define AGC_PNRFATT6_LNAMIXRFATT14_DEFAULT             (_AGC_PNRFATT6_LNAMIXRFATT14_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_PNRFATT6       */

/* Bit fields for AGC PNRFATT7 */
#define _AGC_PNRFATT7_RESETVALUE                       0x10FE0D98UL                                /**< Default value for AGC_PNRFATT7              */
#define _AGC_PNRFATT7_MASK                             0x3FFF3FFFUL                                /**< Mask for AGC_PNRFATT7                       */
#define _AGC_PNRFATT7_LNAMIXRFATT15_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT15           */
#define _AGC_PNRFATT7_LNAMIXRFATT15_MASK               0x3FFFUL                                    /**< Bit mask for AGC_LNAMIXRFATT15              */
#define _AGC_PNRFATT7_LNAMIXRFATT15_DEFAULT            0x00000D98UL                                /**< Mode DEFAULT for AGC_PNRFATT7               */
#define AGC_PNRFATT7_LNAMIXRFATT15_DEFAULT             (_AGC_PNRFATT7_LNAMIXRFATT15_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT7       */
#define _AGC_PNRFATT7_LNAMIXRFATT16_SHIFT              16                                          /**< Shift value for AGC_LNAMIXRFATT16           */
#define _AGC_PNRFATT7_LNAMIXRFATT16_MASK               0x3FFF0000UL                                /**< Bit mask for AGC_LNAMIXRFATT16              */
#define _AGC_PNRFATT7_LNAMIXRFATT16_DEFAULT            0x000010FEUL                                /**< Mode DEFAULT for AGC_PNRFATT7               */
#define AGC_PNRFATT7_LNAMIXRFATT16_DEFAULT             (_AGC_PNRFATT7_LNAMIXRFATT16_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_PNRFATT7       */

/* Bit fields for AGC PNRFATT8 */
#define _AGC_PNRFATT8_RESETVALUE                       0x1BF815FEUL                                /**< Default value for AGC_PNRFATT8              */
#define _AGC_PNRFATT8_MASK                             0x3FFF3FFFUL                                /**< Mask for AGC_PNRFATT8                       */
#define _AGC_PNRFATT8_LNAMIXRFATT17_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT17           */
#define _AGC_PNRFATT8_LNAMIXRFATT17_MASK               0x3FFFUL                                    /**< Bit mask for AGC_LNAMIXRFATT17              */
#define _AGC_PNRFATT8_LNAMIXRFATT17_DEFAULT            0x000015FEUL                                /**< Mode DEFAULT for AGC_PNRFATT8               */
#define AGC_PNRFATT8_LNAMIXRFATT17_DEFAULT             (_AGC_PNRFATT8_LNAMIXRFATT17_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT8       */
#define _AGC_PNRFATT8_LNAMIXRFATT18_SHIFT              16                                          /**< Shift value for AGC_LNAMIXRFATT18           */
#define _AGC_PNRFATT8_LNAMIXRFATT18_MASK               0x3FFF0000UL                                /**< Bit mask for AGC_LNAMIXRFATT18              */
#define _AGC_PNRFATT8_LNAMIXRFATT18_DEFAULT            0x00001BF8UL                                /**< Mode DEFAULT for AGC_PNRFATT8               */
#define AGC_PNRFATT8_LNAMIXRFATT18_DEFAULT             (_AGC_PNRFATT8_LNAMIXRFATT18_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_PNRFATT8       */

