SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_agc.h
/* Bit fields for AGC PNRFATT9 */
#define _AGC_PNRFATT9_RESETVALUE                       0x2DB423DCUL                                /**< Default value for AGC_PNRFATT9              */
#define _AGC_PNRFATT9_MASK                             0x3FFF3FFFUL                                /**< Mask for AGC_PNRFATT9                       */
#define _AGC_PNRFATT9_LNAMIXRFATT19_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT19           */
#define _AGC_PNRFATT9_LNAMIXRFATT19_MASK               0x3FFFUL                                    /**< Bit mask for AGC_LNAMIXRFATT19              */
#define _AGC_PNRFATT9_LNAMIXRFATT19_DEFAULT            0x000023DCUL                                /**< Mode DEFAULT for AGC_PNRFATT9               */
#define AGC_PNRFATT9_LNAMIXRFATT19_DEFAULT             (_AGC_PNRFATT9_LNAMIXRFATT19_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT9       */
#define _AGC_PNRFATT9_LNAMIXRFATT20_SHIFT              16                                          /**< Shift value for AGC_LNAMIXRFATT20           */
#define _AGC_PNRFATT9_LNAMIXRFATT20_MASK               0x3FFF0000UL                                /**< Bit mask for AGC_LNAMIXRFATT20              */
#define _AGC_PNRFATT9_LNAMIXRFATT20_DEFAULT            0x00002DB4UL                                /**< Mode DEFAULT for AGC_PNRFATT9               */
#define AGC_PNRFATT9_LNAMIXRFATT20_DEFAULT             (_AGC_PNRFATT9_LNAMIXRFATT20_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_PNRFATT9       */

/* Bit fields for AGC PNRFATT10 */
#define _AGC_PNRFATT10_RESETVALUE                      0x3FFF39D0UL                                 /**< Default value for AGC_PNRFATT10             */
#define _AGC_PNRFATT10_MASK                            0x3FFF3FFFUL                                 /**< Mask for AGC_PNRFATT10                      */
#define _AGC_PNRFATT10_LNAMIXRFATT21_SHIFT             0                                            /**< Shift value for AGC_LNAMIXRFATT21           */
#define _AGC_PNRFATT10_LNAMIXRFATT21_MASK              0x3FFFUL                                     /**< Bit mask for AGC_LNAMIXRFATT21              */
#define _AGC_PNRFATT10_LNAMIXRFATT21_DEFAULT           0x000039D0UL                                 /**< Mode DEFAULT for AGC_PNRFATT10              */
#define AGC_PNRFATT10_LNAMIXRFATT21_DEFAULT            (_AGC_PNRFATT10_LNAMIXRFATT21_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT10      */
#define _AGC_PNRFATT10_LNAMIXRFATT22_SHIFT             16                                           /**< Shift value for AGC_LNAMIXRFATT22           */
#define _AGC_PNRFATT10_LNAMIXRFATT22_MASK              0x3FFF0000UL                                 /**< Bit mask for AGC_LNAMIXRFATT22              */
#define _AGC_PNRFATT10_LNAMIXRFATT22_DEFAULT           0x00003FFFUL                                 /**< Mode DEFAULT for AGC_PNRFATT10              */
#define AGC_PNRFATT10_LNAMIXRFATT22_DEFAULT            (_AGC_PNRFATT10_LNAMIXRFATT22_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_PNRFATT10      */

/* Bit fields for AGC PNRFATT11 */
#define _AGC_PNRFATT11_RESETVALUE                      0x00003FFFUL                                /**< Default value for AGC_PNRFATT11             */
#define _AGC_PNRFATT11_MASK                            0x00003FFFUL                                /**< Mask for AGC_PNRFATT11                      */
#define _AGC_PNRFATT11_LNAMIXRFATT23_SHIFT             0                                           /**< Shift value for AGC_LNAMIXRFATT23           */
#define _AGC_PNRFATT11_LNAMIXRFATT23_MASK              0x3FFFUL                                    /**< Bit mask for AGC_LNAMIXRFATT23              */
#define _AGC_PNRFATT11_LNAMIXRFATT23_DEFAULT           0x00003FFFUL                                /**< Mode DEFAULT for AGC_PNRFATT11              */
#define AGC_PNRFATT11_LNAMIXRFATT23_DEFAULT            (_AGC_PNRFATT11_LNAMIXRFATT23_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_PNRFATT11      */

/* Bit fields for AGC PNRFATTALT */
#define _AGC_PNRFATTALT_RESETVALUE                     0x00003FFFUL                                  /**< Default value for AGC_PNRFATTALT            */
#define _AGC_PNRFATTALT_MASK                           0x00003FFFUL                                  /**< Mask for AGC_PNRFATTALT                     */
#define _AGC_PNRFATTALT_LNAMIXRFATTALT_SHIFT           0                                             /**< Shift value for AGC_LNAMIXRFATTALT          */
#define _AGC_PNRFATTALT_LNAMIXRFATTALT_MASK            0x3FFFUL                                      /**< Bit mask for AGC_LNAMIXRFATTALT             */
#define _AGC_PNRFATTALT_LNAMIXRFATTALT_DEFAULT         0x00003FFFUL                                  /**< Mode DEFAULT for AGC_PNRFATTALT             */
#define AGC_PNRFATTALT_LNAMIXRFATTALT_DEFAULT          (_AGC_PNRFATTALT_LNAMIXRFATTALT_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_PNRFATTALT     */

/* Bit fields for AGC LNAMIXCODE0 */
#define _AGC_LNAMIXCODE0_RESETVALUE                    0x15724BBDUL                                  /**< Default value for AGC_LNAMIXCODE0           */
#define _AGC_LNAMIXCODE0_MASK                          0x3FFFFFFFUL                                  /**< Mask for AGC_LNAMIXCODE0                    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE1_SHIFT            0                                             /**< Shift value for AGC_LNAMIXSLICE1            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE1_MASK             0x3FUL                                        /**< Bit mask for AGC_LNAMIXSLICE1               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE1_DEFAULT          0x0000003DUL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE1_DEFAULT           (_AGC_LNAMIXCODE0_LNAMIXSLICE1_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE2_SHIFT            6                                             /**< Shift value for AGC_LNAMIXSLICE2            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE2_MASK             0xFC0UL                                       /**< Bit mask for AGC_LNAMIXSLICE2               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE2_DEFAULT          0x0000002EUL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE2_DEFAULT           (_AGC_LNAMIXCODE0_LNAMIXSLICE2_DEFAULT << 6)  /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE3_SHIFT            12                                            /**< Shift value for AGC_LNAMIXSLICE3            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE3_MASK             0x3F000UL                                     /**< Bit mask for AGC_LNAMIXSLICE3               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE3_DEFAULT          0x00000024UL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE3_DEFAULT           (_AGC_LNAMIXCODE0_LNAMIXSLICE3_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE4_SHIFT            18                                            /**< Shift value for AGC_LNAMIXSLICE4            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE4_MASK             0xFC0000UL                                    /**< Bit mask for AGC_LNAMIXSLICE4               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE4_DEFAULT          0x0000001CUL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE4_DEFAULT           (_AGC_LNAMIXCODE0_LNAMIXSLICE4_DEFAULT << 18) /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE5_SHIFT            24                                            /**< Shift value for AGC_LNAMIXSLICE5            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE5_MASK             0x3F000000UL                                  /**< Bit mask for AGC_LNAMIXSLICE5               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE5_DEFAULT          0x00000015UL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE5_DEFAULT           (_AGC_LNAMIXCODE0_LNAMIXSLICE5_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */

