SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_agc.h
/* Bit fields for AGC RSSIABSTHR */
#define _AGC_RSSIABSTHR_RESETVALUE                     0x00000000UL                                 /**< Default value for AGC_RSSIABSTHR            */
#define _AGC_RSSIABSTHR_MASK                           0x0000FFFFUL                                 /**< Mask for AGC_RSSIABSTHR                     */
#define _AGC_RSSIABSTHR_RSSIHIGHTHRSH_SHIFT            0                                            /**< Shift value for AGC_RSSIHIGHTHRSH           */
#define _AGC_RSSIABSTHR_RSSIHIGHTHRSH_MASK             0xFFUL                                       /**< Bit mask for AGC_RSSIHIGHTHRSH              */
#define _AGC_RSSIABSTHR_RSSIHIGHTHRSH_DEFAULT          0x00000000UL                                 /**< Mode DEFAULT for AGC_RSSIABSTHR             */
#define AGC_RSSIABSTHR_RSSIHIGHTHRSH_DEFAULT           (_AGC_RSSIABSTHR_RSSIHIGHTHRSH_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_RSSIABSTHR     */
#define _AGC_RSSIABSTHR_RSSILOWTHRSH_SHIFT             8                                            /**< Shift value for AGC_RSSILOWTHRSH            */
#define _AGC_RSSIABSTHR_RSSILOWTHRSH_MASK              0xFF00UL                                     /**< Bit mask for AGC_RSSILOWTHRSH               */
#define _AGC_RSSIABSTHR_RSSILOWTHRSH_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for AGC_RSSIABSTHR             */
#define AGC_RSSIABSTHR_RSSILOWTHRSH_DEFAULT            (_AGC_RSSIABSTHR_RSSILOWTHRSH_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_RSSIABSTHR     */

/* Bit fields for AGC LNABOOST */
#define _AGC_LNABOOST_RESETVALUE                       0x000001FEUL                               /**< Default value for AGC_LNABOOST              */
#define _AGC_LNABOOST_MASK                             0x000001FFUL                               /**< Mask for AGC_LNABOOST                       */
#define AGC_LNABOOST_BOOSTLNA                          (0x1UL << 0)                               /**< LNA GAIN BOOST mode                         */
#define _AGC_LNABOOST_BOOSTLNA_SHIFT                   0                                          /**< Shift value for AGC_BOOSTLNA                */
#define _AGC_LNABOOST_BOOSTLNA_MASK                    0x1UL                                      /**< Bit mask for AGC_BOOSTLNA                   */
#define _AGC_LNABOOST_BOOSTLNA_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for AGC_LNABOOST               */
#define AGC_LNABOOST_BOOSTLNA_DEFAULT                  (_AGC_LNABOOST_BOOSTLNA_DEFAULT << 0)      /**< Shifted mode DEFAULT for AGC_LNABOOST       */
#define _AGC_LNABOOST_LNABWADJ_SHIFT                   1                                          /**< Shift value for AGC_LNABWADJ                */
#define _AGC_LNABOOST_LNABWADJ_MASK                    0x1EUL                                     /**< Bit mask for AGC_LNABWADJ                   */
#define _AGC_LNABOOST_LNABWADJ_DEFAULT                 0x0000000FUL                               /**< Mode DEFAULT for AGC_LNABOOST               */
#define AGC_LNABOOST_LNABWADJ_DEFAULT                  (_AGC_LNABOOST_LNABWADJ_DEFAULT << 1)      /**< Shifted mode DEFAULT for AGC_LNABOOST       */
#define _AGC_LNABOOST_LNABWADJBOOST_SHIFT              5                                          /**< Shift value for AGC_LNABWADJBOOST           */
#define _AGC_LNABOOST_LNABWADJBOOST_MASK               0x1E0UL                                    /**< Bit mask for AGC_LNABWADJBOOST              */
#define _AGC_LNABOOST_LNABWADJBOOST_DEFAULT            0x0000000FUL                               /**< Mode DEFAULT for AGC_LNABOOST               */
#define AGC_LNABOOST_LNABWADJBOOST_DEFAULT             (_AGC_LNABOOST_LNABWADJBOOST_DEFAULT << 5) /**< Shifted mode DEFAULT for AGC_LNABOOST       */

/* Bit fields for AGC ANTDIV */
#define _AGC_ANTDIV_RESETVALUE                         0x00000000UL                                /**< Default value for AGC_ANTDIV                */
#define _AGC_ANTDIV_MASK                               0x000007FFUL                                /**< Mask for AGC_ANTDIV                         */
#define _AGC_ANTDIV_GAINMODE_SHIFT                     0                                           /**< Shift value for AGC_GAINMODE                */
#define _AGC_ANTDIV_GAINMODE_MASK                      0x3UL                                       /**< Bit mask for AGC_GAINMODE                   */
#define _AGC_ANTDIV_GAINMODE_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for AGC_ANTDIV                 */
#define _AGC_ANTDIV_GAINMODE_DISABLE                   0x00000000UL                                /**< Mode DISABLE for AGC_ANTDIV                 */
#define _AGC_ANTDIV_GAINMODE_SINGLE_PACKET             0x00000001UL                                /**< Mode SINGLE_PACKET for AGC_ANTDIV           */
#define _AGC_ANTDIV_GAINMODE_ALWAYS                    0x00000002UL                                /**< Mode ALWAYS for AGC_ANTDIV                  */
#define AGC_ANTDIV_GAINMODE_DEFAULT                    (_AGC_ANTDIV_GAINMODE_DEFAULT << 0)         /**< Shifted mode DEFAULT for AGC_ANTDIV         */
#define AGC_ANTDIV_GAINMODE_DISABLE                    (_AGC_ANTDIV_GAINMODE_DISABLE << 0)         /**< Shifted mode DISABLE for AGC_ANTDIV         */
#define AGC_ANTDIV_GAINMODE_SINGLE_PACKET              (_AGC_ANTDIV_GAINMODE_SINGLE_PACKET << 0)   /**< Shifted mode SINGLE_PACKET for AGC_ANTDIV   */
#define AGC_ANTDIV_GAINMODE_ALWAYS                     (_AGC_ANTDIV_GAINMODE_ALWAYS << 0)          /**< Shifted mode ALWAYS for AGC_ANTDIV          */
#define _AGC_ANTDIV_DEBOUNCECNTTHD_SHIFT               2                                           /**< Shift value for AGC_DEBOUNCECNTTHD          */
#define _AGC_ANTDIV_DEBOUNCECNTTHD_MASK                0x1FCUL                                     /**< Bit mask for AGC_DEBOUNCECNTTHD             */
#define _AGC_ANTDIV_DEBOUNCECNTTHD_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for AGC_ANTDIV                 */
#define AGC_ANTDIV_DEBOUNCECNTTHD_DEFAULT              (_AGC_ANTDIV_DEBOUNCECNTTHD_DEFAULT << 2)   /**< Shifted mode DEFAULT for AGC_ANTDIV         */
#define _AGC_ANTDIV_DISRSSIANTDIVFIX_SHIFT             9                                           /**< Shift value for AGC_DISRSSIANTDIVFIX        */
#define _AGC_ANTDIV_DISRSSIANTDIVFIX_MASK              0x600UL                                     /**< Bit mask for AGC_DISRSSIANTDIVFIX           */
#define _AGC_ANTDIV_DISRSSIANTDIVFIX_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for AGC_ANTDIV                 */
#define AGC_ANTDIV_DISRSSIANTDIVFIX_DEFAULT            (_AGC_ANTDIV_DISRSSIANTDIVFIX_DEFAULT << 9) /**< Shifted mode DEFAULT for AGC_ANTDIV         */

/* Bit fields for AGC DUALRFPKDTHD0 */
#define _AGC_DUALRFPKDTHD0_RESETVALUE                  0x000A0001UL                                    /**< Default value for AGC_DUALRFPKDTHD0         */
#define _AGC_DUALRFPKDTHD0_MASK                        0x0FFF0FFFUL                                    /**< Mask for AGC_DUALRFPKDTHD0                  */
#define _AGC_DUALRFPKDTHD0_RFPKDLOWTHD0_SHIFT          0                                               /**< Shift value for AGC_RFPKDLOWTHD0            */
#define _AGC_DUALRFPKDTHD0_RFPKDLOWTHD0_MASK           0xFFFUL                                         /**< Bit mask for AGC_RFPKDLOWTHD0               */
#define _AGC_DUALRFPKDTHD0_RFPKDLOWTHD0_DEFAULT        0x00000001UL                                    /**< Mode DEFAULT for AGC_DUALRFPKDTHD0          */
#define AGC_DUALRFPKDTHD0_RFPKDLOWTHD0_DEFAULT         (_AGC_DUALRFPKDTHD0_RFPKDLOWTHD0_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_DUALRFPKDTHD0  */
#define _AGC_DUALRFPKDTHD0_RFPKDLOWTHD1_SHIFT          16                                              /**< Shift value for AGC_RFPKDLOWTHD1            */
#define _AGC_DUALRFPKDTHD0_RFPKDLOWTHD1_MASK           0xFFF0000UL                                     /**< Bit mask for AGC_RFPKDLOWTHD1               */
#define _AGC_DUALRFPKDTHD0_RFPKDLOWTHD1_DEFAULT        0x0000000AUL                                    /**< Mode DEFAULT for AGC_DUALRFPKDTHD0          */
#define AGC_DUALRFPKDTHD0_RFPKDLOWTHD1_DEFAULT         (_AGC_DUALRFPKDTHD0_RFPKDLOWTHD1_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_DUALRFPKDTHD0  */

/* Bit fields for AGC DUALRFPKDTHD1 */
#define _AGC_DUALRFPKDTHD1_RESETVALUE                  0x00280001UL                                   /**< Default value for AGC_DUALRFPKDTHD1         */
#define _AGC_DUALRFPKDTHD1_MASK                        0x0FFF0FFFUL                                   /**< Mask for AGC_DUALRFPKDTHD1                  */
#define _AGC_DUALRFPKDTHD1_RFPKDHITHD0_SHIFT           0                                              /**< Shift value for AGC_RFPKDHITHD0             */
#define _AGC_DUALRFPKDTHD1_RFPKDHITHD0_MASK            0xFFFUL                                        /**< Bit mask for AGC_RFPKDHITHD0                */
#define _AGC_DUALRFPKDTHD1_RFPKDHITHD0_DEFAULT         0x00000001UL                                   /**< Mode DEFAULT for AGC_DUALRFPKDTHD1          */
#define AGC_DUALRFPKDTHD1_RFPKDHITHD0_DEFAULT          (_AGC_DUALRFPKDTHD1_RFPKDHITHD0_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_DUALRFPKDTHD1  */
#define _AGC_DUALRFPKDTHD1_RFPKDHITHD1_SHIFT           16                                             /**< Shift value for AGC_RFPKDHITHD1             */
#define _AGC_DUALRFPKDTHD1_RFPKDHITHD1_MASK            0xFFF0000UL                                    /**< Bit mask for AGC_RFPKDHITHD1                */
#define _AGC_DUALRFPKDTHD1_RFPKDHITHD1_DEFAULT         0x00000028UL                                   /**< Mode DEFAULT for AGC_DUALRFPKDTHD1          */
#define AGC_DUALRFPKDTHD1_RFPKDHITHD1_DEFAULT          (_AGC_DUALRFPKDTHD1_RFPKDHITHD1_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_DUALRFPKDTHD1  */

/* Bit fields for AGC SPARE */
#define _AGC_SPARE_RESETVALUE                          0x00000000UL                       /**< Default value for AGC_SPARE                 */
#define _AGC_SPARE_MASK                                0x000000FFUL                       /**< Mask for AGC_SPARE                          */
#define _AGC_SPARE_SPAREREG_SHIFT                      0                                  /**< Shift value for AGC_SPAREREG                */
#define _AGC_SPARE_SPAREREG_MASK                       0xFFUL                             /**< Bit mask for AGC_SPAREREG                   */
#define _AGC_SPARE_SPAREREG_DEFAULT                    0x00000000UL                       /**< Mode DEFAULT for AGC_SPARE                  */
#define AGC_SPARE_SPAREREG_DEFAULT                     (_AGC_SPARE_SPAREREG_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_SPARE          */

/* Bit fields for AGC FLARE */
#define _AGC_FLARE_RESETVALUE                          0x00000004UL                         /**< Default value for AGC_FLARE                 */
#define _AGC_FLARE_MASK                                0x0000001FUL                         /**< Mask for AGC_FLARE                          */
#define _AGC_FLARE_PNATTENTHD_SHIFT                    0                                    /**< Shift value for AGC_PNATTENTHD              */
#define _AGC_FLARE_PNATTENTHD_MASK                     0x1FUL                               /**< Bit mask for AGC_PNATTENTHD                 */
#define _AGC_FLARE_PNATTENTHD_DEFAULT                  0x00000004UL                         /**< Mode DEFAULT for AGC_FLARE                  */
#define AGC_FLARE_PNATTENTHD_DEFAULT                   (_AGC_FLARE_PNATTENTHD_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_FLARE          */

/* Bit fields for AGC STEPDWNSAFE */
#define _AGC_STEPDWNSAFE_RESETVALUE                    0x00036D11UL                                   /**< Default value for AGC_STEPDWNSAFE           */
#define _AGC_STEPDWNSAFE_MASK                          0x0007FFFFUL                                   /**< Mask for AGC_STEPDWNSAFE                    */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE0_SHIFT            0                                              /**< Shift value for AGC_STEPDWNSAFE0            */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE0_MASK             0x7UL                                          /**< Bit mask for AGC_STEPDWNSAFE0               */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE0_DEFAULT          0x00000001UL                                   /**< Mode DEFAULT for AGC_STEPDWNSAFE            */
#define AGC_STEPDWNSAFE_STEPDWNSAFE0_DEFAULT           (_AGC_STEPDWNSAFE_STEPDWNSAFE0_DEFAULT << 0)   /**< Shifted mode DEFAULT for AGC_STEPDWNSAFE    */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE1_SHIFT            3                                              /**< Shift value for AGC_STEPDWNSAFE1            */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE1_MASK             0x38UL                                         /**< Bit mask for AGC_STEPDWNSAFE1               */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE1_DEFAULT          0x00000002UL                                   /**< Mode DEFAULT for AGC_STEPDWNSAFE            */
#define AGC_STEPDWNSAFE_STEPDWNSAFE1_DEFAULT           (_AGC_STEPDWNSAFE_STEPDWNSAFE1_DEFAULT << 3)   /**< Shifted mode DEFAULT for AGC_STEPDWNSAFE    */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE2_SHIFT            6                                              /**< Shift value for AGC_STEPDWNSAFE2            */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE2_MASK             0x1C0UL                                        /**< Bit mask for AGC_STEPDWNSAFE2               */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE2_DEFAULT          0x00000004UL                                   /**< Mode DEFAULT for AGC_STEPDWNSAFE            */
#define AGC_STEPDWNSAFE_STEPDWNSAFE2_DEFAULT           (_AGC_STEPDWNSAFE_STEPDWNSAFE2_DEFAULT << 6)   /**< Shifted mode DEFAULT for AGC_STEPDWNSAFE    */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE3_SHIFT            9                                              /**< Shift value for AGC_STEPDWNSAFE3            */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE3_MASK             0xE00UL                                        /**< Bit mask for AGC_STEPDWNSAFE3               */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE3_DEFAULT          0x00000006UL                                   /**< Mode DEFAULT for AGC_STEPDWNSAFE            */
#define AGC_STEPDWNSAFE_STEPDWNSAFE3_DEFAULT           (_AGC_STEPDWNSAFE_STEPDWNSAFE3_DEFAULT << 9)   /**< Shifted mode DEFAULT for AGC_STEPDWNSAFE    */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE4_SHIFT            12                                             /**< Shift value for AGC_STEPDWNSAFE4            */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE4_MASK             0x7000UL                                       /**< Bit mask for AGC_STEPDWNSAFE4               */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE4_DEFAULT          0x00000006UL                                   /**< Mode DEFAULT for AGC_STEPDWNSAFE            */
#define AGC_STEPDWNSAFE_STEPDWNSAFE4_DEFAULT           (_AGC_STEPDWNSAFE_STEPDWNSAFE4_DEFAULT << 12)  /**< Shifted mode DEFAULT for AGC_STEPDWNSAFE    */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE5_SHIFT            15                                             /**< Shift value for AGC_STEPDWNSAFE5            */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE5_MASK             0x38000UL                                      /**< Bit mask for AGC_STEPDWNSAFE5               */
#define _AGC_STEPDWNSAFE_STEPDWNSAFE5_DEFAULT          0x00000006UL                                   /**< Mode DEFAULT for AGC_STEPDWNSAFE            */
#define AGC_STEPDWNSAFE_STEPDWNSAFE5_DEFAULT           (_AGC_STEPDWNSAFE_STEPDWNSAFE5_DEFAULT << 15)  /**< Shifted mode DEFAULT for AGC_STEPDWNSAFE    */
#define AGC_STEPDWNSAFE_STEPDWNSAFEEN                  (0x1UL << 18)                                  /**< New BitField                                */
#define _AGC_STEPDWNSAFE_STEPDWNSAFEEN_SHIFT           18                                             /**< Shift value for AGC_STEPDWNSAFEEN           */
#define _AGC_STEPDWNSAFE_STEPDWNSAFEEN_MASK            0x40000UL                                      /**< Bit mask for AGC_STEPDWNSAFEEN              */
#define _AGC_STEPDWNSAFE_STEPDWNSAFEEN_DEFAULT         0x00000000UL                                   /**< Mode DEFAULT for AGC_STEPDWNSAFE            */
#define AGC_STEPDWNSAFE_STEPDWNSAFEEN_DEFAULT          (_AGC_STEPDWNSAFE_STEPDWNSAFEEN_DEFAULT << 18) /**< Shifted mode DEFAULT for AGC_STEPDWNSAFE    */

