SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_agc.h
/* Bit fields for AGC COLLDETCTRL */
#define _AGC_COLLDETCTRL_RESETVALUE                    0x00002800UL                                        /**< Default value for AGC_COLLDETCTRL           */
#define _AGC_COLLDETCTRL_MASK                          0x03007F8FUL                                        /**< Mask for AGC_COLLDETCTRL                    */
#define AGC_COLLDETCTRL_UPONMARSSI                     (0x1UL << 0)                                        /**< Collision detect enable                     */
#define _AGC_COLLDETCTRL_UPONMARSSI_SHIFT              0                                                   /**< Shift value for AGC_UPONMARSSI              */
#define _AGC_COLLDETCTRL_UPONMARSSI_MASK               0x1UL                                               /**< Bit mask for AGC_UPONMARSSI                 */
#define _AGC_COLLDETCTRL_UPONMARSSI_DEFAULT            0x00000000UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define AGC_COLLDETCTRL_UPONMARSSI_DEFAULT             (_AGC_COLLDETCTRL_UPONMARSSI_DEFAULT << 0)          /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */
#define _AGC_COLLDETCTRL_INPUTSEL_SHIFT                1                                                   /**< Shift value for AGC_INPUTSEL                */
#define _AGC_COLLDETCTRL_INPUTSEL_MASK                 0x6UL                                               /**< Bit mask for AGC_INPUTSEL                   */
#define _AGC_COLLDETCTRL_INPUTSEL_DEFAULT              0x00000000UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define _AGC_COLLDETCTRL_INPUTSEL_FEFILTSEL            0x00000000UL                                        /**< Mode FEFILTSEL for AGC_COLLDETCTRL          */
#define _AGC_COLLDETCTRL_INPUTSEL_LEGACY               0x00000001UL                                        /**< Mode LEGACY for AGC_COLLDETCTRL             */
#define _AGC_COLLDETCTRL_INPUTSEL_SOFTM                0x00000002UL                                        /**< Mode SOFTM for AGC_COLLDETCTRL              */
#define _AGC_COLLDETCTRL_INPUTSEL_BOTH                 0x00000003UL                                        /**< Mode BOTH for AGC_COLLDETCTRL               */
#define AGC_COLLDETCTRL_INPUTSEL_DEFAULT               (_AGC_COLLDETCTRL_INPUTSEL_DEFAULT << 1)            /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_INPUTSEL_FEFILTSEL             (_AGC_COLLDETCTRL_INPUTSEL_FEFILTSEL << 1)          /**< Shifted mode FEFILTSEL for AGC_COLLDETCTRL  */
#define AGC_COLLDETCTRL_INPUTSEL_LEGACY                (_AGC_COLLDETCTRL_INPUTSEL_LEGACY << 1)             /**< Shifted mode LEGACY for AGC_COLLDETCTRL     */
#define AGC_COLLDETCTRL_INPUTSEL_SOFTM                 (_AGC_COLLDETCTRL_INPUTSEL_SOFTM << 1)              /**< Shifted mode SOFTM for AGC_COLLDETCTRL      */
#define AGC_COLLDETCTRL_INPUTSEL_BOTH                  (_AGC_COLLDETCTRL_INPUTSEL_BOTH << 1)               /**< Shifted mode BOTH for AGC_COLLDETCTRL       */
#define AGC_COLLDETCTRL_RSSIINSEL                      (0x1UL << 3)                                        /**< RSSI select for collsion detection          */
#define _AGC_COLLDETCTRL_RSSIINSEL_SHIFT               3                                                   /**< Shift value for AGC_RSSIINSEL               */
#define _AGC_COLLDETCTRL_RSSIINSEL_MASK                0x8UL                                               /**< Bit mask for AGC_RSSIINSEL                  */
#define _AGC_COLLDETCTRL_RSSIINSEL_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define _AGC_COLLDETCTRL_RSSIINSEL_MAFILTER            0x00000000UL                                        /**< Mode MAFILTER for AGC_COLLDETCTRL           */
#define _AGC_COLLDETCTRL_RSSIINSEL_AVGRSSI             0x00000001UL                                        /**< Mode AVGRSSI for AGC_COLLDETCTRL            */
#define AGC_COLLDETCTRL_RSSIINSEL_DEFAULT              (_AGC_COLLDETCTRL_RSSIINSEL_DEFAULT << 3)           /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_RSSIINSEL_MAFILTER             (_AGC_COLLDETCTRL_RSSIINSEL_MAFILTER << 3)          /**< Shifted mode MAFILTER for AGC_COLLDETCTRL   */
#define AGC_COLLDETCTRL_RSSIINSEL_AVGRSSI              (_AGC_COLLDETCTRL_RSSIINSEL_AVGRSSI << 3)           /**< Shifted mode AVGRSSI for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_OVRTHDSEL                      (0x1UL << 7)                                        /**< Override Threshold select                   */
#define _AGC_COLLDETCTRL_OVRTHDSEL_SHIFT               7                                                   /**< Shift value for AGC_OVRTHDSEL               */
#define _AGC_COLLDETCTRL_OVRTHDSEL_MASK                0x80UL                                              /**< Bit mask for AGC_OVRTHDSEL                  */
#define _AGC_COLLDETCTRL_OVRTHDSEL_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define AGC_COLLDETCTRL_OVRTHDSEL_DEFAULT              (_AGC_COLLDETCTRL_OVRTHDSEL_DEFAULT << 7)           /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */
#define _AGC_COLLDETCTRL_MALATCHSEL_SHIFT              8                                                   /**< Shift value for AGC_MALATCHSEL              */
#define _AGC_COLLDETCTRL_MALATCHSEL_MASK               0x300UL                                             /**< Bit mask for AGC_MALATCHSEL                 */
#define _AGC_COLLDETCTRL_MALATCHSEL_DEFAULT            0x00000000UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define _AGC_COLLDETCTRL_MALATCHSEL_RE_PRE_DET         0x00000000UL                                        /**< Mode RE_PRE_DET for AGC_COLLDETCTRL         */
#define _AGC_COLLDETCTRL_MALATCHSEL_RE_SYNC_DET        0x00000001UL                                        /**< Mode RE_SYNC_DET for AGC_COLLDETCTRL        */
#define _AGC_COLLDETCTRL_MALATCHSEL_EITHER1            0x00000002UL                                        /**< Mode EITHER1 for AGC_COLLDETCTRL            */
#define _AGC_COLLDETCTRL_MALATCHSEL_EITHER2            0x00000003UL                                        /**< Mode EITHER2 for AGC_COLLDETCTRL            */
#define AGC_COLLDETCTRL_MALATCHSEL_DEFAULT             (_AGC_COLLDETCTRL_MALATCHSEL_DEFAULT << 8)          /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_MALATCHSEL_RE_PRE_DET          (_AGC_COLLDETCTRL_MALATCHSEL_RE_PRE_DET << 8)       /**< Shifted mode RE_PRE_DET for AGC_COLLDETCTRL */
#define AGC_COLLDETCTRL_MALATCHSEL_RE_SYNC_DET         (_AGC_COLLDETCTRL_MALATCHSEL_RE_SYNC_DET << 8)      /**< Shifted mode RE_SYNC_DET for AGC_COLLDETCTRL*/
#define AGC_COLLDETCTRL_MALATCHSEL_EITHER1             (_AGC_COLLDETCTRL_MALATCHSEL_EITHER1 << 8)          /**< Shifted mode EITHER1 for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_MALATCHSEL_EITHER2             (_AGC_COLLDETCTRL_MALATCHSEL_EITHER2 << 8)          /**< Shifted mode EITHER2 for AGC_COLLDETCTRL    */
#define _AGC_COLLDETCTRL_MACOMPENSEL_SHIFT             10                                                  /**< Shift value for AGC_MACOMPENSEL             */
#define _AGC_COLLDETCTRL_MACOMPENSEL_MASK              0xC00UL                                             /**< Bit mask for AGC_MACOMPENSEL                */
#define _AGC_COLLDETCTRL_MACOMPENSEL_DEFAULT           0x00000002UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define _AGC_COLLDETCTRL_MACOMPENSEL_PRE_DET           0x00000000UL                                        /**< Mode PRE_DET for AGC_COLLDETCTRL            */
#define _AGC_COLLDETCTRL_MACOMPENSEL_FRAME_SYNC_DET    0x00000001UL                                        /**< Mode FRAME_SYNC_DET for AGC_COLLDETCTRL     */
#define _AGC_COLLDETCTRL_MACOMPENSEL_BOTH1             0x00000002UL                                        /**< Mode BOTH1 for AGC_COLLDETCTRL              */
#define _AGC_COLLDETCTRL_MACOMPENSEL_BOTH2             0x00000003UL                                        /**< Mode BOTH2 for AGC_COLLDETCTRL              */
#define AGC_COLLDETCTRL_MACOMPENSEL_DEFAULT            (_AGC_COLLDETCTRL_MACOMPENSEL_DEFAULT << 10)        /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_MACOMPENSEL_PRE_DET            (_AGC_COLLDETCTRL_MACOMPENSEL_PRE_DET << 10)        /**< Shifted mode PRE_DET for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_MACOMPENSEL_FRAME_SYNC_DET     (_AGC_COLLDETCTRL_MACOMPENSEL_FRAME_SYNC_DET << 10) /**< Shifted mode FRAME_SYNC_DET for AGC_COLLDETCTRL*/
#define AGC_COLLDETCTRL_MACOMPENSEL_BOTH1              (_AGC_COLLDETCTRL_MACOMPENSEL_BOTH1 << 10)          /**< Shifted mode BOTH1 for AGC_COLLDETCTRL      */
#define AGC_COLLDETCTRL_MACOMPENSEL_BOTH2              (_AGC_COLLDETCTRL_MACOMPENSEL_BOTH2 << 10)          /**< Shifted mode BOTH2 for AGC_COLLDETCTRL      */
#define _AGC_COLLDETCTRL_MATAP_SHIFT                   12                                                  /**< Shift value for AGC_MATAP                   */
#define _AGC_COLLDETCTRL_MATAP_MASK                    0x3000UL                                            /**< Bit mask for AGC_MATAP                      */
#define _AGC_COLLDETCTRL_MATAP_DEFAULT                 0x00000002UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define _AGC_COLLDETCTRL_MATAP_TAPS2                   0x00000000UL                                        /**< Mode TAPS2 for AGC_COLLDETCTRL              */
#define _AGC_COLLDETCTRL_MATAP_TAPS4                   0x00000001UL                                        /**< Mode TAPS4 for AGC_COLLDETCTRL              */
#define _AGC_COLLDETCTRL_MATAP_TAPS8                   0x00000002UL                                        /**< Mode TAPS8 for AGC_COLLDETCTRL              */
#define _AGC_COLLDETCTRL_MATAP_TAPS16                  0x00000003UL                                        /**< Mode TAPS16 for AGC_COLLDETCTRL             */
#define AGC_COLLDETCTRL_MATAP_DEFAULT                  (_AGC_COLLDETCTRL_MATAP_DEFAULT << 12)              /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_MATAP_TAPS2                    (_AGC_COLLDETCTRL_MATAP_TAPS2 << 12)                /**< Shifted mode TAPS2 for AGC_COLLDETCTRL      */
#define AGC_COLLDETCTRL_MATAP_TAPS4                    (_AGC_COLLDETCTRL_MATAP_TAPS4 << 12)                /**< Shifted mode TAPS4 for AGC_COLLDETCTRL      */
#define AGC_COLLDETCTRL_MATAP_TAPS8                    (_AGC_COLLDETCTRL_MATAP_TAPS8 << 12)                /**< Shifted mode TAPS8 for AGC_COLLDETCTRL      */
#define AGC_COLLDETCTRL_MATAP_TAPS16                   (_AGC_COLLDETCTRL_MATAP_TAPS16 << 12)               /**< Shifted mode TAPS16 for AGC_COLLDETCTRL     */
#define AGC_COLLDETCTRL_FLTBYP                         (0x1UL << 14)                                       /**< RSSI MA fllter bypass                       */
#define _AGC_COLLDETCTRL_FLTBYP_SHIFT                  14                                                  /**< Shift value for AGC_FLTBYP                  */
#define _AGC_COLLDETCTRL_FLTBYP_MASK                   0x4000UL                                            /**< Bit mask for AGC_FLTBYP                     */
#define _AGC_COLLDETCTRL_FLTBYP_DEFAULT                0x00000000UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define AGC_COLLDETCTRL_FLTBYP_DEFAULT                 (_AGC_COLLDETCTRL_FLTBYP_DEFAULT << 14)             /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_LATCHRSSIEN                    (0x1UL << 24)                                       /**< Enable RSSI latch by SW                     */
#define _AGC_COLLDETCTRL_LATCHRSSIEN_SHIFT             24                                                  /**< Shift value for AGC_LATCHRSSIEN             */
#define _AGC_COLLDETCTRL_LATCHRSSIEN_MASK              0x1000000UL                                         /**< Bit mask for AGC_LATCHRSSIEN                */
#define _AGC_COLLDETCTRL_LATCHRSSIEN_DEFAULT           0x00000000UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define AGC_COLLDETCTRL_LATCHRSSIEN_DEFAULT            (_AGC_COLLDETCTRL_LATCHRSSIEN_DEFAULT << 24)        /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */
#define AGC_COLLDETCTRL_LATCHRSSI                      (0x1UL << 25)                                       /**< lacth RSSI                                  */
#define _AGC_COLLDETCTRL_LATCHRSSI_SHIFT               25                                                  /**< Shift value for AGC_LATCHRSSI               */
#define _AGC_COLLDETCTRL_LATCHRSSI_MASK                0x2000000UL                                         /**< Bit mask for AGC_LATCHRSSI                  */
#define _AGC_COLLDETCTRL_LATCHRSSI_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for AGC_COLLDETCTRL            */
#define AGC_COLLDETCTRL_LATCHRSSI_DEFAULT              (_AGC_COLLDETCTRL_LATCHRSSI_DEFAULT << 25)          /**< Shifted mode DEFAULT for AGC_COLLDETCTRL    */

/* Bit fields for AGC COLLDETTHD */
#define _AGC_COLLDETTHD_RESETVALUE                     0x00281606UL                                 /**< Default value for AGC_COLLDETTHD            */
#define _AGC_COLLDETTHD_MASK                           0x07FDFF0FUL                                 /**< Mask for AGC_COLLDETTHD                     */
#define _AGC_COLLDETTHD_MATHRESHOLD_SHIFT              0                                            /**< Shift value for AGC_MATHRESHOLD             */
#define _AGC_COLLDETTHD_MATHRESHOLD_MASK               0xFUL                                        /**< Bit mask for AGC_MATHRESHOLD                */
#define _AGC_COLLDETTHD_MATHRESHOLD_DEFAULT            0x00000006UL                                 /**< Mode DEFAULT for AGC_COLLDETTHD             */
#define AGC_COLLDETTHD_MATHRESHOLD_DEFAULT             (_AGC_COLLDETTHD_MATHRESHOLD_DEFAULT << 0)   /**< Shifted mode DEFAULT for AGC_COLLDETTHD     */
#define _AGC_COLLDETTHD_MINTHRESHOLD_SHIFT             8                                            /**< Shift value for AGC_MINTHRESHOLD            */
#define _AGC_COLLDETTHD_MINTHRESHOLD_MASK              0x1FF00UL                                    /**< Bit mask for AGC_MINTHRESHOLD               */
#define _AGC_COLLDETTHD_MINTHRESHOLD_DEFAULT           0x00000016UL                                 /**< Mode DEFAULT for AGC_COLLDETTHD             */
#define AGC_COLLDETTHD_MINTHRESHOLD_DEFAULT            (_AGC_COLLDETTHD_MINTHRESHOLD_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_COLLDETTHD     */
#define _AGC_COLLDETTHD_OVRTHRESHOLD_SHIFT             18                                           /**< Shift value for AGC_OVRTHRESHOLD            */
#define _AGC_COLLDETTHD_OVRTHRESHOLD_MASK              0x7FC0000UL                                  /**< Bit mask for AGC_OVRTHRESHOLD               */
#define _AGC_COLLDETTHD_OVRTHRESHOLD_DEFAULT           0x0000000AUL                                 /**< Mode DEFAULT for AGC_COLLDETTHD             */
#define AGC_COLLDETTHD_OVRTHRESHOLD_DEFAULT            (_AGC_COLLDETTHD_OVRTHRESHOLD_DEFAULT << 18) /**< Shifted mode DEFAULT for AGC_COLLDETTHD     */

/* Bit fields for AGC COLLDETSTATUS */
#define _AGC_COLLDETSTATUS_RESETVALUE                  0x00000000UL                                /**< Default value for AGC_COLLDETSTATUS         */
#define _AGC_COLLDETSTATUS_MASK                        0x000001FFUL                                /**< Mask for AGC_COLLDETSTATUS                  */
#define _AGC_COLLDETSTATUS_MAFLTDOUT_SHIFT             0                                           /**< Shift value for AGC_MAFLTDOUT               */
#define _AGC_COLLDETSTATUS_MAFLTDOUT_MASK              0x1FFUL                                     /**< Bit mask for AGC_MAFLTDOUT                  */
#define _AGC_COLLDETSTATUS_MAFLTDOUT_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for AGC_COLLDETSTATUS          */
#define AGC_COLLDETSTATUS_MAFLTDOUT_DEFAULT            (_AGC_COLLDETSTATUS_MAFLTDOUT_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_COLLDETSTATUS  */

/* Bit fields for AGC SETTLINGINDCTRL */
#define _AGC_SETTLINGINDCTRL_RESETVALUE                0x00010100UL                                /**< Default value for AGC_SETTLINGINDCTRL       */
#define _AGC_SETTLINGINDCTRL_MASK                      0x003F3F01UL                                /**< Mask for AGC_SETTLINGINDCTRL                */
#define AGC_SETTLINGINDCTRL_EN                         (0x1UL << 0)                                /**< AGC Settling Indicator Enable               */
#define _AGC_SETTLINGINDCTRL_EN_SHIFT                  0                                           /**< Shift value for AGC_EN                      */
#define _AGC_SETTLINGINDCTRL_EN_MASK                   0x1UL                                       /**< Bit mask for AGC_EN                         */
#define _AGC_SETTLINGINDCTRL_EN_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for AGC_SETTLINGINDCTRL        */
#define AGC_SETTLINGINDCTRL_EN_DEFAULT                 (_AGC_SETTLINGINDCTRL_EN_DEFAULT << 0)      /**< Shifted mode DEFAULT for AGC_SETTLINGINDCTRL*/
#define _AGC_SETTLINGINDCTRL_POSTHD_SHIFT              8                                           /**< Shift value for AGC_POSTHD                  */
#define _AGC_SETTLINGINDCTRL_POSTHD_MASK               0x3F00UL                                    /**< Bit mask for AGC_POSTHD                     */
#define _AGC_SETTLINGINDCTRL_POSTHD_DEFAULT            0x00000001UL                                /**< Mode DEFAULT for AGC_SETTLINGINDCTRL        */
#define AGC_SETTLINGINDCTRL_POSTHD_DEFAULT             (_AGC_SETTLINGINDCTRL_POSTHD_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_SETTLINGINDCTRL*/
#define _AGC_SETTLINGINDCTRL_NEGTHD_SHIFT              16                                          /**< Shift value for AGC_NEGTHD                  */
#define _AGC_SETTLINGINDCTRL_NEGTHD_MASK               0x3F0000UL                                  /**< Bit mask for AGC_NEGTHD                     */
#define _AGC_SETTLINGINDCTRL_NEGTHD_DEFAULT            0x00000001UL                                /**< Mode DEFAULT for AGC_SETTLINGINDCTRL        */
#define AGC_SETTLINGINDCTRL_NEGTHD_DEFAULT             (_AGC_SETTLINGINDCTRL_NEGTHD_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_SETTLINGINDCTRL*/

/* Bit fields for AGC SETTLINGINDPER */
#define _AGC_SETTLINGINDPER_RESETVALUE                 0x02000100UL                                     /**< Default value for AGC_SETTLINGINDPER        */
#define _AGC_SETTLINGINDPER_MASK                       0xFFFFFFFFUL                                     /**< Mask for AGC_SETTLINGINDPER                 */
#define _AGC_SETTLINGINDPER_SETTLEDPERIOD_SHIFT        0                                                /**< Shift value for AGC_SETTLEDPERIOD           */
#define _AGC_SETTLINGINDPER_SETTLEDPERIOD_MASK         0xFFFFUL                                         /**< Bit mask for AGC_SETTLEDPERIOD              */
#define _AGC_SETTLINGINDPER_SETTLEDPERIOD_DEFAULT      0x00000100UL                                     /**< Mode DEFAULT for AGC_SETTLINGINDPER         */
#define AGC_SETTLINGINDPER_SETTLEDPERIOD_DEFAULT       (_AGC_SETTLINGINDPER_SETTLEDPERIOD_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_SETTLINGINDPER */
#define _AGC_SETTLINGINDPER_DELAYPERIOD_SHIFT          16                                               /**< Shift value for AGC_DELAYPERIOD             */
#define _AGC_SETTLINGINDPER_DELAYPERIOD_MASK           0xFFFF0000UL                                     /**< Bit mask for AGC_DELAYPERIOD                */
#define _AGC_SETTLINGINDPER_DELAYPERIOD_DEFAULT        0x00000200UL                                     /**< Mode DEFAULT for AGC_SETTLINGINDPER         */
#define AGC_SETTLINGINDPER_DELAYPERIOD_DEFAULT         (_AGC_SETTLINGINDPER_DELAYPERIOD_DEFAULT << 16)  /**< Shifted mode DEFAULT for AGC_SETTLINGINDPER */

