SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_agc.h
/* Bit fields for AGC SMFIF */
#define _AGC_SMFIF_RESETVALUE                          0x00000000UL                                      /**< Default value for AGC_SMFIF                 */
#define _AGC_SMFIF_MASK                                0x0003FF7DUL                                      /**< Mask for AGC_SMFIF                          */
#define AGC_SMFIF_RSSIVALIDSFMIF                       (0x1UL << 0)                                      /**< RSSI Value is Valid                         */
#define _AGC_SMFIF_RSSIVALIDSFMIF_SHIFT                0                                                 /**< Shift value for AGC_RSSIVALIDSFMIF          */
#define _AGC_SMFIF_RSSIVALIDSFMIF_MASK                 0x1UL                                             /**< Bit mask for AGC_RSSIVALIDSFMIF             */
#define _AGC_SMFIF_RSSIVALIDSFMIF_DEFAULT              0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_RSSIVALIDSFMIF_DEFAULT               (_AGC_SMFIF_RSSIVALIDSFMIF_DEFAULT << 0)          /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_CCASFMIF                             (0x1UL << 2)                                      /**< Clear Channel Assessment                    */
#define _AGC_SMFIF_CCASFMIF_SHIFT                      2                                                 /**< Shift value for AGC_CCASFMIF                */
#define _AGC_SMFIF_CCASFMIF_MASK                       0x4UL                                             /**< Bit mask for AGC_CCASFMIF                   */
#define _AGC_SMFIF_CCASFMIF_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_CCASFMIF_DEFAULT                     (_AGC_SMFIF_CCASFMIF_DEFAULT << 2)                /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_RSSIPOSSTEPSFMIF                     (0x1UL << 3)                                      /**< Positive RSSI Step Detected                 */
#define _AGC_SMFIF_RSSIPOSSTEPSFMIF_SHIFT              3                                                 /**< Shift value for AGC_RSSIPOSSTEPSFMIF        */
#define _AGC_SMFIF_RSSIPOSSTEPSFMIF_MASK               0x8UL                                             /**< Bit mask for AGC_RSSIPOSSTEPSFMIF           */
#define _AGC_SMFIF_RSSIPOSSTEPSFMIF_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_RSSIPOSSTEPSFMIF_DEFAULT             (_AGC_SMFIF_RSSIPOSSTEPSFMIF_DEFAULT << 3)        /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_RSSINEGSTEPSFMIF                     (0x1UL << 4)                                      /**< Negative RSSI Step Detected                 */
#define _AGC_SMFIF_RSSINEGSTEPSFMIF_SHIFT              4                                                 /**< Shift value for AGC_RSSINEGSTEPSFMIF        */
#define _AGC_SMFIF_RSSINEGSTEPSFMIF_MASK               0x10UL                                            /**< Bit mask for AGC_RSSINEGSTEPSFMIF           */
#define _AGC_SMFIF_RSSINEGSTEPSFMIF_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_RSSINEGSTEPSFMIF_DEFAULT             (_AGC_SMFIF_RSSINEGSTEPSFMIF_DEFAULT << 4)        /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_SHORTRSSIPOSSTEPSFMIF                (0x1UL << 6)                                      /**< Short-term Positive RSSI Step Detected      */
#define _AGC_SMFIF_SHORTRSSIPOSSTEPSFMIF_SHIFT         6                                                 /**< Shift value for AGC_SHORTRSSIPOSSTEPSFMIF   */
#define _AGC_SMFIF_SHORTRSSIPOSSTEPSFMIF_MASK          0x40UL                                            /**< Bit mask for AGC_SHORTRSSIPOSSTEPSFMIF      */
#define _AGC_SMFIF_SHORTRSSIPOSSTEPSFMIF_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_SHORTRSSIPOSSTEPSFMIF_DEFAULT        (_AGC_SMFIF_SHORTRSSIPOSSTEPSFMIF_DEFAULT << 6)   /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_RFPKDPRDDONESFMIF                    (0x1UL << 8)                                      /**< RF PKD PERIOD CNT TOMEOUT                   */
#define _AGC_SMFIF_RFPKDPRDDONESFMIF_SHIFT             8                                                 /**< Shift value for AGC_RFPKDPRDDONESFMIF       */
#define _AGC_SMFIF_RFPKDPRDDONESFMIF_MASK              0x100UL                                           /**< Bit mask for AGC_RFPKDPRDDONESFMIF          */
#define _AGC_SMFIF_RFPKDPRDDONESFMIF_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_RFPKDPRDDONESFMIF_DEFAULT            (_AGC_SMFIF_RFPKDPRDDONESFMIF_DEFAULT << 8)       /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_RFPKDCNTDONESFMIF                    (0x1UL << 9)                                      /**< RF PKD pulse CNT TOMEOUT                    */
#define _AGC_SMFIF_RFPKDCNTDONESFMIF_SHIFT             9                                                 /**< Shift value for AGC_RFPKDCNTDONESFMIF       */
#define _AGC_SMFIF_RFPKDCNTDONESFMIF_MASK              0x200UL                                           /**< Bit mask for AGC_RFPKDCNTDONESFMIF          */
#define _AGC_SMFIF_RFPKDCNTDONESFMIF_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_RFPKDCNTDONESFMIF_DEFAULT            (_AGC_SMFIF_RFPKDCNTDONESFMIF_DEFAULT << 9)       /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_RSSIHIGHSFMIF                        (0x1UL << 10)                                     /**< RSSI high detected                          */
#define _AGC_SMFIF_RSSIHIGHSFMIF_SHIFT                 10                                                /**< Shift value for AGC_RSSIHIGHSFMIF           */
#define _AGC_SMFIF_RSSIHIGHSFMIF_MASK                  0x400UL                                           /**< Bit mask for AGC_RSSIHIGHSFMIF              */
#define _AGC_SMFIF_RSSIHIGHSFMIF_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_RSSIHIGHSFMIF_DEFAULT                (_AGC_SMFIF_RSSIHIGHSFMIF_DEFAULT << 10)          /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_RSSILOWSFMIF                         (0x1UL << 11)                                     /**< RSSI low detected                           */
#define _AGC_SMFIF_RSSILOWSFMIF_SHIFT                  11                                                /**< Shift value for AGC_RSSILOWSFMIF            */
#define _AGC_SMFIF_RSSILOWSFMIF_MASK                   0x800UL                                           /**< Bit mask for AGC_RSSILOWSFMIF               */
#define _AGC_SMFIF_RSSILOWSFMIF_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_RSSILOWSFMIF_DEFAULT                 (_AGC_SMFIF_RSSILOWSFMIF_DEFAULT << 11)           /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_CCANODETSFMIF                        (0x1UL << 12)                                     /**< CCA Not Detected                            */
#define _AGC_SMFIF_CCANODETSFMIF_SHIFT                 12                                                /**< Shift value for AGC_CCANODETSFMIF           */
#define _AGC_SMFIF_CCANODETSFMIF_MASK                  0x1000UL                                          /**< Bit mask for AGC_CCANODETSFMIF              */
#define _AGC_SMFIF_CCANODETSFMIF_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_CCANODETSFMIF_DEFAULT                (_AGC_SMFIF_CCANODETSFMIF_DEFAULT << 12)          /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_GAINBELOWGAINTHDSFMIF                (0x1UL << 13)                                     /**< agc gain above threshold int                */
#define _AGC_SMFIF_GAINBELOWGAINTHDSFMIF_SHIFT         13                                                /**< Shift value for AGC_GAINBELOWGAINTHDSFMIF   */
#define _AGC_SMFIF_GAINBELOWGAINTHDSFMIF_MASK          0x2000UL                                          /**< Bit mask for AGC_GAINBELOWGAINTHDSFMIF      */
#define _AGC_SMFIF_GAINBELOWGAINTHDSFMIF_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_GAINBELOWGAINTHDSFMIF_DEFAULT        (_AGC_SMFIF_GAINBELOWGAINTHDSFMIF_DEFAULT << 13)  /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_GAINUPDATEFRZSFMIF                   (0x1UL << 14)                                     /**< AGC gain update frozen int                  */
#define _AGC_SMFIF_GAINUPDATEFRZSFMIF_SHIFT            14                                                /**< Shift value for AGC_GAINUPDATEFRZSFMIF      */
#define _AGC_SMFIF_GAINUPDATEFRZSFMIF_MASK             0x4000UL                                          /**< Bit mask for AGC_GAINUPDATEFRZSFMIF         */
#define _AGC_SMFIF_GAINUPDATEFRZSFMIF_DEFAULT          0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_GAINUPDATEFRZSFMIF_DEFAULT           (_AGC_SMFIF_GAINUPDATEFRZSFMIF_DEFAULT << 14)     /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_PNATTENSFMIF                         (0x1UL << 15)                                     /**< PN attenuation is exceeding threshold       */
#define _AGC_SMFIF_PNATTENSFMIF_SHIFT                  15                                                /**< Shift value for AGC_PNATTENSFMIF            */
#define _AGC_SMFIF_PNATTENSFMIF_MASK                   0x8000UL                                          /**< Bit mask for AGC_PNATTENSFMIF               */
#define _AGC_SMFIF_PNATTENSFMIF_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_PNATTENSFMIF_DEFAULT                 (_AGC_SMFIF_PNATTENSFMIF_DEFAULT << 15)           /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_COLLDETRSSIMAPRESFMIF                (0x1UL << 16)                                     /**< Collision Detection outside of frame        */
#define _AGC_SMFIF_COLLDETRSSIMAPRESFMIF_SHIFT         16                                                /**< Shift value for AGC_COLLDETRSSIMAPRESFMIF   */
#define _AGC_SMFIF_COLLDETRSSIMAPRESFMIF_MASK          0x10000UL                                         /**< Bit mask for AGC_COLLDETRSSIMAPRESFMIF      */
#define _AGC_SMFIF_COLLDETRSSIMAPRESFMIF_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_COLLDETRSSIMAPRESFMIF_DEFAULT        (_AGC_SMFIF_COLLDETRSSIMAPRESFMIF_DEFAULT << 16)  /**< Shifted mode DEFAULT for AGC_SMFIF          */
#define AGC_SMFIF_COLLDETRSSIMASYNCSFMIF               (0x1UL << 17)                                     /**< Collsion detection during frame             */
#define _AGC_SMFIF_COLLDETRSSIMASYNCSFMIF_SHIFT        17                                                /**< Shift value for AGC_COLLDETRSSIMASYNCSFMIF  */
#define _AGC_SMFIF_COLLDETRSSIMASYNCSFMIF_MASK         0x20000UL                                         /**< Bit mask for AGC_COLLDETRSSIMASYNCSFMIF     */
#define _AGC_SMFIF_COLLDETRSSIMASYNCSFMIF_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_SMFIF                  */
#define AGC_SMFIF_COLLDETRSSIMASYNCSFMIF_DEFAULT       (_AGC_SMFIF_COLLDETRSSIMASYNCSFMIF_DEFAULT << 17) /**< Shifted mode DEFAULT for AGC_SMFIF          */

