SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_agc.h
/* Bit fields for AGC SFMIEN */
#define _AGC_SFMIEN_RESETVALUE                         0x00000000UL                                        /**< Default value for AGC_SFMIEN                */
#define _AGC_SFMIEN_MASK                               0x0003FF7DUL                                        /**< Mask for AGC_SFMIEN                         */
#define AGC_SFMIEN_RSSIVALIDSFMIEN                     (0x1UL << 0)                                        /**< RSSIVALID Interrupt Enable                  */
#define _AGC_SFMIEN_RSSIVALIDSFMIEN_SHIFT              0                                                   /**< Shift value for AGC_RSSIVALIDSFMIEN         */
#define _AGC_SFMIEN_RSSIVALIDSFMIEN_MASK               0x1UL                                               /**< Bit mask for AGC_RSSIVALIDSFMIEN            */
#define _AGC_SFMIEN_RSSIVALIDSFMIEN_DEFAULT            0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_RSSIVALIDSFMIEN_DEFAULT             (_AGC_SFMIEN_RSSIVALIDSFMIEN_DEFAULT << 0)          /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_CCASFMIEN                           (0x1UL << 2)                                        /**< CCA Interrupt Enable                        */
#define _AGC_SFMIEN_CCASFMIEN_SHIFT                    2                                                   /**< Shift value for AGC_CCASFMIEN               */
#define _AGC_SFMIEN_CCASFMIEN_MASK                     0x4UL                                               /**< Bit mask for AGC_CCASFMIEN                  */
#define _AGC_SFMIEN_CCASFMIEN_DEFAULT                  0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_CCASFMIEN_DEFAULT                   (_AGC_SFMIEN_CCASFMIEN_DEFAULT << 2)                /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_RSSIPOSSTEPSFMIEN                   (0x1UL << 3)                                        /**< RSSIPOSSTEP Interrupt Enable                */
#define _AGC_SFMIEN_RSSIPOSSTEPSFMIEN_SHIFT            3                                                   /**< Shift value for AGC_RSSIPOSSTEPSFMIEN       */
#define _AGC_SFMIEN_RSSIPOSSTEPSFMIEN_MASK             0x8UL                                               /**< Bit mask for AGC_RSSIPOSSTEPSFMIEN          */
#define _AGC_SFMIEN_RSSIPOSSTEPSFMIEN_DEFAULT          0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_RSSIPOSSTEPSFMIEN_DEFAULT           (_AGC_SFMIEN_RSSIPOSSTEPSFMIEN_DEFAULT << 3)        /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_RSSINEGSTEPSFMIEN                   (0x1UL << 4)                                        /**< RSSINEGSTEP Interrupt Enable                */
#define _AGC_SFMIEN_RSSINEGSTEPSFMIEN_SHIFT            4                                                   /**< Shift value for AGC_RSSINEGSTEPSFMIEN       */
#define _AGC_SFMIEN_RSSINEGSTEPSFMIEN_MASK             0x10UL                                              /**< Bit mask for AGC_RSSINEGSTEPSFMIEN          */
#define _AGC_SFMIEN_RSSINEGSTEPSFMIEN_DEFAULT          0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_RSSINEGSTEPSFMIEN_DEFAULT           (_AGC_SFMIEN_RSSINEGSTEPSFMIEN_DEFAULT << 4)        /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_SHORTRSSIPOSSTEPSFMIEN              (0x1UL << 6)                                        /**< SHORTRSSIPOSSTEP Interrupt Enable           */
#define _AGC_SFMIEN_SHORTRSSIPOSSTEPSFMIEN_SHIFT       6                                                   /**< Shift value for AGC_SHORTRSSIPOSSTEPSFMIEN  */
#define _AGC_SFMIEN_SHORTRSSIPOSSTEPSFMIEN_MASK        0x40UL                                              /**< Bit mask for AGC_SHORTRSSIPOSSTEPSFMIEN     */
#define _AGC_SFMIEN_SHORTRSSIPOSSTEPSFMIEN_DEFAULT     0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_SHORTRSSIPOSSTEPSFMIEN_DEFAULT      (_AGC_SFMIEN_SHORTRSSIPOSSTEPSFMIEN_DEFAULT << 6)   /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_RFPKDPRDDONESFMIEN                  (0x1UL << 8)                                        /**< RF PKD PERIOD CNT Interrupt Enable          */
#define _AGC_SFMIEN_RFPKDPRDDONESFMIEN_SHIFT           8                                                   /**< Shift value for AGC_RFPKDPRDDONESFMIEN      */
#define _AGC_SFMIEN_RFPKDPRDDONESFMIEN_MASK            0x100UL                                             /**< Bit mask for AGC_RFPKDPRDDONESFMIEN         */
#define _AGC_SFMIEN_RFPKDPRDDONESFMIEN_DEFAULT         0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_RFPKDPRDDONESFMIEN_DEFAULT          (_AGC_SFMIEN_RFPKDPRDDONESFMIEN_DEFAULT << 8)       /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_RFPKDCNTDONESFMIEN                  (0x1UL << 9)                                        /**< RF PKD pulse CNT Interrupt Enable           */
#define _AGC_SFMIEN_RFPKDCNTDONESFMIEN_SHIFT           9                                                   /**< Shift value for AGC_RFPKDCNTDONESFMIEN      */
#define _AGC_SFMIEN_RFPKDCNTDONESFMIEN_MASK            0x200UL                                             /**< Bit mask for AGC_RFPKDCNTDONESFMIEN         */
#define _AGC_SFMIEN_RFPKDCNTDONESFMIEN_DEFAULT         0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_RFPKDCNTDONESFMIEN_DEFAULT          (_AGC_SFMIEN_RFPKDCNTDONESFMIEN_DEFAULT << 9)       /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_RSSIHIGHSFMIEN                      (0x1UL << 10)                                       /**< RSSIHIGH Interrupt Enable                   */
#define _AGC_SFMIEN_RSSIHIGHSFMIEN_SHIFT               10                                                  /**< Shift value for AGC_RSSIHIGHSFMIEN          */
#define _AGC_SFMIEN_RSSIHIGHSFMIEN_MASK                0x400UL                                             /**< Bit mask for AGC_RSSIHIGHSFMIEN             */
#define _AGC_SFMIEN_RSSIHIGHSFMIEN_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_RSSIHIGHSFMIEN_DEFAULT              (_AGC_SFMIEN_RSSIHIGHSFMIEN_DEFAULT << 10)          /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_RSSILOWSFMIEN                       (0x1UL << 11)                                       /**< RSSILOW Interrupt Enable                    */
#define _AGC_SFMIEN_RSSILOWSFMIEN_SHIFT                11                                                  /**< Shift value for AGC_RSSILOWSFMIEN           */
#define _AGC_SFMIEN_RSSILOWSFMIEN_MASK                 0x800UL                                             /**< Bit mask for AGC_RSSILOWSFMIEN              */
#define _AGC_SFMIEN_RSSILOWSFMIEN_DEFAULT              0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_RSSILOWSFMIEN_DEFAULT               (_AGC_SFMIEN_RSSILOWSFMIEN_DEFAULT << 11)           /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_CCANODETSFMIEN                      (0x1UL << 12)                                       /**< CCANODET Interrupt Enable                   */
#define _AGC_SFMIEN_CCANODETSFMIEN_SHIFT               12                                                  /**< Shift value for AGC_CCANODETSFMIEN          */
#define _AGC_SFMIEN_CCANODETSFMIEN_MASK                0x1000UL                                            /**< Bit mask for AGC_CCANODETSFMIEN             */
#define _AGC_SFMIEN_CCANODETSFMIEN_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_CCANODETSFMIEN_DEFAULT              (_AGC_SFMIEN_CCANODETSFMIEN_DEFAULT << 12)          /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_GAINBELOWGAINTHDSFMIEN              (0x1UL << 13)                                       /**< GAINBELOWGAINTHD Interrupt Enable           */
#define _AGC_SFMIEN_GAINBELOWGAINTHDSFMIEN_SHIFT       13                                                  /**< Shift value for AGC_GAINBELOWGAINTHDSFMIEN  */
#define _AGC_SFMIEN_GAINBELOWGAINTHDSFMIEN_MASK        0x2000UL                                            /**< Bit mask for AGC_GAINBELOWGAINTHDSFMIEN     */
#define _AGC_SFMIEN_GAINBELOWGAINTHDSFMIEN_DEFAULT     0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_GAINBELOWGAINTHDSFMIEN_DEFAULT      (_AGC_SFMIEN_GAINBELOWGAINTHDSFMIEN_DEFAULT << 13)  /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_GAINUPDATEFRZSFMIEN                 (0x1UL << 14)                                       /**< AGC gain update frozen int Enable           */
#define _AGC_SFMIEN_GAINUPDATEFRZSFMIEN_SHIFT          14                                                  /**< Shift value for AGC_GAINUPDATEFRZSFMIEN     */
#define _AGC_SFMIEN_GAINUPDATEFRZSFMIEN_MASK           0x4000UL                                            /**< Bit mask for AGC_GAINUPDATEFRZSFMIEN        */
#define _AGC_SFMIEN_GAINUPDATEFRZSFMIEN_DEFAULT        0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_GAINUPDATEFRZSFMIEN_DEFAULT         (_AGC_SFMIEN_GAINUPDATEFRZSFMIEN_DEFAULT << 14)     /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_PNATTENSFMIEN                       (0x1UL << 15)                                       /**< PN attenuation is exceeding threshold       */
#define _AGC_SFMIEN_PNATTENSFMIEN_SHIFT                15                                                  /**< Shift value for AGC_PNATTENSFMIEN           */
#define _AGC_SFMIEN_PNATTENSFMIEN_MASK                 0x8000UL                                            /**< Bit mask for AGC_PNATTENSFMIEN              */
#define _AGC_SFMIEN_PNATTENSFMIEN_DEFAULT              0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_PNATTENSFMIEN_DEFAULT               (_AGC_SFMIEN_PNATTENSFMIEN_DEFAULT << 15)           /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_COLLDETRSSIMAPRESFMIEN              (0x1UL << 16)                                       /**< Collision Detection outside of frame        */
#define _AGC_SFMIEN_COLLDETRSSIMAPRESFMIEN_SHIFT       16                                                  /**< Shift value for AGC_COLLDETRSSIMAPRESFMIEN  */
#define _AGC_SFMIEN_COLLDETRSSIMAPRESFMIEN_MASK        0x10000UL                                           /**< Bit mask for AGC_COLLDETRSSIMAPRESFMIEN     */
#define _AGC_SFMIEN_COLLDETRSSIMAPRESFMIEN_DEFAULT     0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_COLLDETRSSIMAPRESFMIEN_DEFAULT      (_AGC_SFMIEN_COLLDETRSSIMAPRESFMIEN_DEFAULT << 16)  /**< Shifted mode DEFAULT for AGC_SFMIEN         */
#define AGC_SFMIEN_COLLDETRSSIMASYNCSFMIEN             (0x1UL << 17)                                       /**< Collsion detection during frame             */
#define _AGC_SFMIEN_COLLDETRSSIMASYNCSFMIEN_SHIFT      17                                                  /**< Shift value for AGC_COLLDETRSSIMASYNCSFMIEN */
#define _AGC_SFMIEN_COLLDETRSSIMASYNCSFMIEN_MASK       0x20000UL                                           /**< Bit mask for AGC_COLLDETRSSIMASYNCSFMIEN    */
#define _AGC_SFMIEN_COLLDETRSSIMASYNCSFMIEN_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_SFMIEN                 */
#define AGC_SFMIEN_COLLDETRSSIMASYNCSFMIEN_DEFAULT     (_AGC_SFMIEN_COLLDETRSSIMASYNCSFMIEN_DEFAULT << 17) /**< Shifted mode DEFAULT for AGC_SFMIEN         */

/** @} End of group EFR32FG25_AGC_BitFields */
/** @} End of group EFR32FG25_AGC */
/** @} End of group Parts */

#endif /* EFR32FG25_AGC_H */
